MatheusPinto/rt-robot/rt_robot/board/pin_mux.c
    gpio_pin_config_t IR_SS3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE23 (pin 16)  */
    GPIO_PinInit(BOARD_INITPINS_IR_SS3_GPIO, BOARD_INITPINS_IR_SS3_PIN, &IR_SS3_config);

    gpio_pin_config_t IR_SS4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE29 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_IR_SS4_GPIO, BOARD_INITPINS_IR_SS4_PIN, &IR_SS4_config);

    gpio_pin_config_t IR_SS5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTE30 (pin 22)  */
    GPIO_PinInit(BOARD_INITPINS_IR_SS5_GPIO, BOARD_INITPINS_IR_SS5_PIN, &IR_SS5_config);

    /* PORTA1 (pin 27) is configured as UART0_RX */
    PORT_SetPinMux(BOARD_INITPINS_DEBUG_UART_RX_PORT, BOARD_INITPINS_DEBUG_UART_RX_PIN, kPORT_MuxAlt2);

    /* PORTA12 (pin 32) is configured as TPM1_CH0 */
    PORT_SetPinMux(PORTA, 12U, kPORT_MuxAlt3);

    /* PORTA13 (pin 33) is configured as PTA13 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_RS_PORT, BOARD_INITPINS_LCD_RS_PIN, kPORT_MuxAsGpio);

    /* PORTA16 (pin 36) is configured as PTA16 */
    PORT_SetPinMux(BOARD_INITPINS_ULTRA_TRIG_L_PORT, BOARD_INITPINS_ULTRA_TRIG_L_PIN, kPORT_MuxAsGpio);

    /* PORTA2 (pin 28) is configured as UART0_TX */
    PORT_SetPinMux(BOARD_INITPINS_DEBUG_UART_TX_PORT, BOARD_INITPINS_DEBUG_UART_TX_PIN, kPORT_MuxAlt2);

    /* PORTA4 (pin 30) is configured as PTA4 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D4_PORT, BOARD_INITPINS_LCD_D4_PIN, kPORT_MuxAsGpio);

    /* PORTA5 (pin 31) is configured as PTA5 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D5_PORT, BOARD_INITPINS_LCD_D5_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 44) is configured as TPM1_CH1 */
    PORT_SetPinMux(PORTB, 1U, kPORT_MuxAlt3);

    /* PORTB18 (pin 53) is configured as PTB18 */
    PORT_SetPinMux(BOARD_INITPINS_LED_RED_PORT, BOARD_INITPINS_LED_RED_PIN, kPORT_MuxAsGpio);

    /* PORTB19 (pin 54) is configured as PTB19 */
    PORT_SetPinMux(BOARD_INITPINS_LED_GREEN_PORT, BOARD_INITPINS_LED_GREEN_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 55) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_M_IN2_PORT, BOARD_INITPINS_M_IN2_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 57) is configured as TPM0_CH1 */
    PORT_SetPinMux(BOARD_INITPINS_ULTRA_ECHO_L_PORT, BOARD_INITPINS_ULTRA_ECHO_L_PIN, kPORT_MuxAlt4);

    /* PORTC3 (pin 58) is configured as PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_M_IN3_PORT, BOARD_INITPINS_M_IN3_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 61) is configured as PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_M_IN4_PORT, BOARD_INITPINS_M_IN4_PIN, kPORT_MuxAsGpio);

    /* PORTC7 (pin 64) is configured as PTC7 */
    PORT_SetPinMux(BOARD_INITPINS_M_IN1_PORT, BOARD_INITPINS_M_IN1_PIN, kPORT_MuxAsGpio);

    /* PORTC8 (pin 65) is configured as PTC8 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D6_PORT, BOARD_INITPINS_LCD_D6_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 66) is configured as PTC9 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_D7_PORT, BOARD_INITPINS_LCD_D7_PIN, kPORT_MuxAsGpio);

    /* PORTD0 (pin 73) is configured as TPM0_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_ULTRA_ECHO_F_PORT, BOARD_INITPINS_ULTRA_ECHO_F_PIN, kPORT_MuxAlt4);

    /* PORTD2 (pin 75) is configured as PTD2 */
    PORT_SetPinMux(BOARD_INITPINS_R_ENCODER_PORT, BOARD_INITPINS_R_ENCODER_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD2 (pin 75): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_R_ENCODER_PORT, BOARD_INITPINS_R_ENCODER_PIN, kPORT_InterruptRisingEdge);

    /* PORTD3 (pin 76) is configured as PTD3 */
    PORT_SetPinMux(BOARD_INITPINS_L_ENCODER_PORT, BOARD_INITPINS_L_ENCODER_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTD3 (pin 76): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_INITPINS_L_ENCODER_PORT, BOARD_INITPINS_L_ENCODER_PIN, kPORT_InterruptRisingEdge);

    /* PORTD4 (pin 77) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INITPINS_WCET_MSR_PORT, BOARD_INITPINS_WCET_MSR_PIN, kPORT_MuxAsGpio);

    /* PORTD5 (pin 78) is configured as PTD5 */
    PORT_SetPinMux(BOARD_INITPINS_LCD_EN_PORT, BOARD_INITPINS_LCD_EN_PIN, kPORT_MuxAsGpio);

    /* PORTE0 (pin 1) is configured as I2C1_SDA */
    PORT_SetPinMux(BOARD_INITPINS_MPU_SDA_PORT, BOARD_INITPINS_MPU_SDA_PIN, kPORT_MuxAlt6);

    /* PORTE1 (pin 2) is configured as I2C1_SCL */
    PORT_SetPinMux(BOARD_INITPINS_MPU_SCL_PORT, BOARD_INITPINS_MPU_SCL_PIN, kPORT_MuxAlt6);

    /* PORTE2 (pin 3) is configured as PTE2 */
    PORT_SetPinMux(BOARD_INITPINS_ULTRA_TRIG_R_PORT, BOARD_INITPINS_ULTRA_TRIG_R_PIN, kPORT_MuxAsGpio);

    /* PORTE21 (pin 14) is configured as PTE21 */
    PORT_SetPinMux(BOARD_INITPINS_IR_SS1_PORT, BOARD_INITPINS_IR_SS1_PIN, kPORT_MuxAsGpio);

    /* PORTE22 (pin 15) is configured as PTE22 */
    PORT_SetPinMux(BOARD_INITPINS_IR_SS2_PORT, BOARD_INITPINS_IR_SS2_PIN, kPORT_MuxAsGpio);

    /* PORTE23 (pin 16) is configured as PTE23 */
    PORT_SetPinMux(BOARD_INITPINS_IR_SS3_PORT, BOARD_INITPINS_IR_SS3_PIN, kPORT_MuxAsGpio);

    /* PORTE29 (pin 21) is configured as PTE29 */
    PORT_SetPinMux(BOARD_INITPINS_IR_SS4_PORT, BOARD_INITPINS_IR_SS4_PIN, kPORT_MuxAsGpio);

    /* PORTE3 (pin 4) is configured as PTE3 */
    PORT_SetPinMux(BOARD_INITPINS_ULTRA_TRIG_F_PORT, BOARD_INITPINS_ULTRA_TRIG_F_PIN, kPORT_MuxAsGpio);

    /* PORTE30 (pin 22) is configured as PTE30 */
    PORT_SetPinMux(BOARD_INITPINS_IR_SS5_PORT, BOARD_INITPINS_IR_SS5_PIN, kPORT_MuxAsGpio);

    /* PORTE31 (pin 23) is configured as TPM0_CH4 */
    PORT_SetPinMux(BOARD_INITPINS_ULTRA_ECHO_R_PORT, BOARD_INITPINS_ULTRA_ECHO_R_PIN, kPORT_MuxAlt3);

    /* PORTE5 (pin 6) is configured as PTE5 */
    PORT_SetPinMux(BOARD_INITPINS_KEY_FRONT_PORT, BOARD_INITPINS_KEY_FRONT_PIN, kPORT_MuxAsGpio);

    SIM->SOPT4 = ((SIM->SOPT4 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT4_TPM1CH0SRC_MASK)))

                  /* TPM1 channel 0 input capture source select: TPM1_CH0 signal. */
                  | SIM_SOPT4_TPM1CH0SRC(SOPT4_TPM1CH0SRC_TPM1_CH0));

    SIM->SOPT5 = ((SIM->SOPT5 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT5_UART0TXSRC_MASK | SIM_SOPT5_UART0RXSRC_MASK)))

                  /* UART0 transmit data source select: UART0_TX pin. */
                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX)

                  /* UART0 receive data source select: UART0_RX pin. */
                  | SIM_SOPT5_UART0RXSRC(SOPT5_UART0RXSRC_UART_RX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
